app/controllers/users_controller.rb

SELECT `users`.* FROM `users`
---
  def show
    @users = User.all

SELECT `users`.* FROM `users` WHERE (name LIKE '%m%')
SELECT `users`.* FROM `users`
---
  def find
    @user = if params[:search]
      User.where("name LIKE ?", "%#{params[:search][0..2]}%")
    else
      User.all

INSERT INTO `users` (`email`, `password`, `locate`, `description`, `surname`, `name`) VALUES ('matisebezf@gmail.com', 'zeoifziezj', NULL, NULL, 'bevilavqua', 'Matis')
---
  def create
    user =  User.create(user_params)